class ArticleController02 < ApplicationController
  def index
    # Array
    articles_hoge =
    [
      {"LGTM" => 200, "投稿日" => "2020/02/01", "更新日" => "2021/02/01", "タイトル" => "いいタイトル"},
      {"LGTM" => 200, "投稿日" => "2020/02/01", "更新日" => "2021/02/01", "タイトル" => "いいタイトル"},
      {"LGTM" => 200, "投稿日" => "2020/02/01", "更新日" => "2021/02/01", "タイトル" => "いいタイトル"},
      {"LGTM" => 200, "投稿日" => "2020/02/01", "更新日" => "2021/02/01", "タイトル" => "いいタイトル"},
      {"LGTM" => 200, "投稿日" => "2020/02/01", "更新日" => "2021/02/01", "タイトル" => "いいタイトル"}
    ]
    render("index", locals: {huga: articles_hoge})
  end
end
